<?php
$login = 'root';
$pass = '';
$host = 'localhost';
$nameDB = 'f0810470_test';
$opt = "mysql:host=$host;port=3306;dbname=$nameDB";
$options = array(
	PDO::ATTR_ERRMODE => PDO::ERRMODE_EXCEPTION,
	PDO::ATTR_DEFAULT_FETCH_MODE => PDO::FETCH_ASSOC,
);
$linkDB = new PDO($opt, $login, $pass, $options);

$query = "SELECT * FROM checkup";
$cmd = $linkDB -> query($query);
$checkup = [];
while ($res = $cmd -> fetch()) {
	array_push($checkup, $res);
}
$linkDB = null;
?>

<!DOCTYPE html>
<html lang="ru">

<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<link rel="stylesheet" href="css/style.css">
	<link href="https://fonts.googleapis.com/css2?family=PT+Sans+Caption:wght@400;700&display=swap" rel="stylesheet">
	<link rel="stylesheet" href="https://unpkg.com/swiper@7/swiper-bundle.min.css"/>	<title>Logo</title>
</head>

<body>
	<div class="wrapper">
		<!-- SVG sprite-->
		<svg style="display: none;">
			<symbol id="logo" viewBox="0 0 92 28">
				<path d="M18.213 27H0.401917V1.1333H5.87087V22.1962H18.213V27Z" />
				<path
					d="M16.2582 14.0666C16.2582 11.948 16.5292 10.0511 17.0712 8.37597C17.6132 6.70079 18.3892 5.2966 19.3992 4.1634C20.4339 3.00555 21.6902 2.13102 23.1683 1.53978C24.6464 0.923904 26.3216 0.615967 28.1939 0.615967C30.1893 0.615967 31.926 0.948538 33.4041 1.61368C34.9069 2.25419 36.1509 3.16568 37.1363 4.34816C38.1464 5.53063 38.8977 6.94714 39.3904 8.59768C39.9078 10.2482 40.1664 12.0712 40.1664 14.0666C40.1664 16.1852 39.8831 18.0821 39.3165 19.7573C38.7746 21.4325 37.9862 22.849 36.9516 24.0068C35.9169 25.14 34.6605 26.0146 33.1824 26.6304C31.7043 27.2217 30.0415 27.5173 28.1939 27.5173C26.1984 27.5173 24.4494 27.197 22.9466 26.5565C21.4685 25.8914 20.2245 24.9676 19.2144 23.7851C18.229 22.6026 17.49 21.1861 16.9973 19.5356C16.5046 17.885 16.2582 16.0621 16.2582 14.0666ZM22.0598 14.0666C22.0598 15.3477 22.1829 16.5178 22.4293 17.5771C22.6756 18.6364 23.0452 19.5479 23.5379 20.3116C24.0306 21.0753 24.6587 21.6665 25.4224 22.0853C26.2107 22.5041 27.1346 22.7135 28.1939 22.7135C30.14 22.7135 31.6551 22.0483 32.739 20.7181C33.8229 19.3878 34.3649 17.1706 34.3649 14.0666C34.3649 12.8349 34.2541 11.6894 34.0323 10.6301C33.8106 9.57076 33.4411 8.65927 32.9238 7.89559C32.4311 7.10727 31.7906 6.50371 31.0022 6.08492C30.2386 5.64149 29.3024 5.41978 28.1939 5.41978C26.2723 5.41978 24.7696 6.10955 23.6857 7.48911C22.6017 8.86867 22.0598 11.0612 22.0598 14.0666Z" />
				<path
					d="M53.8596 13.4015H64.428V25.0045C63.8614 25.448 63.2332 25.8298 62.5434 26.1501C61.8783 26.4457 61.1639 26.7043 60.4002 26.9261C59.6611 27.1231 58.8974 27.271 58.1091 27.3695C57.3208 27.468 56.5448 27.5173 55.7811 27.5173C54.0074 27.5173 52.3446 27.2586 50.7926 26.7413C49.2652 26.224 47.9226 25.4233 46.7647 24.3394C45.6315 23.2308 44.7324 21.8266 44.0672 20.1268C43.4267 18.427 43.1065 16.407 43.1065 14.0666C43.1065 11.6278 43.5006 9.55844 44.2889 7.85863C45.0773 6.13419 46.0996 4.74232 47.356 3.68301C48.637 2.59908 50.0535 1.82308 51.6055 1.35502C53.1821 0.862317 54.7465 0.615967 56.2985 0.615967C57.8997 0.615967 59.3039 0.739141 60.511 0.98549C61.7428 1.2072 62.7035 1.42892 63.3933 1.65063L62.2478 6.19578C61.5826 5.97406 60.8313 5.7893 59.9937 5.64149C59.1561 5.49368 58.1091 5.41978 56.8527 5.41978C55.6949 5.41978 54.6356 5.5799 53.6748 5.90016C52.7141 6.19578 51.8765 6.68848 51.1621 7.37825C50.4477 8.06803 49.8934 8.96721 49.4992 10.0758C49.1051 11.1843 48.908 12.527 48.908 14.1036C48.908 15.631 49.1051 16.9366 49.4992 18.0205C49.8934 19.1045 50.423 20.0037 51.0882 20.7181C51.7779 21.4078 52.5663 21.9129 53.4531 22.2331C54.34 22.5534 55.2761 22.7135 56.2615 22.7135C56.9266 22.7135 57.5918 22.6396 58.2569 22.4918C58.9467 22.344 59.5256 22.1099 59.9937 21.7897V17.3184L53.8596 16.7272V13.4015Z" />
				<path
					d="M67.5369 14.0666C67.5369 11.948 67.8079 10.0511 68.3498 8.37597C68.8918 6.70079 69.6678 5.2966 70.6778 4.1634C71.7125 3.00555 72.9689 2.13102 74.447 1.53978C75.9251 0.923904 77.6002 0.615967 79.4725 0.615967C81.4679 0.615967 83.2047 0.948538 84.6828 1.61368C86.1855 2.25419 87.4296 3.16568 88.415 4.34816C89.425 5.53063 90.1764 6.94714 90.6691 8.59768C91.1864 10.2482 91.4451 12.0712 91.4451 14.0666C91.4451 16.1852 91.1618 18.0821 90.5952 19.7573C90.0532 21.4325 89.2649 22.849 88.2302 24.0068C87.1956 25.14 85.9392 26.0146 84.4611 26.6304C82.983 27.2217 81.3201 27.5173 79.4725 27.5173C77.4771 27.5173 75.728 27.197 74.2253 26.5565C72.7472 25.8914 71.5031 24.9676 70.4931 23.7851C69.5077 22.6026 68.7686 21.1861 68.2759 19.5356C67.7832 17.885 67.5369 16.0621 67.5369 14.0666ZM73.3384 14.0666C73.3384 15.3477 73.4616 16.5178 73.7079 17.5771C73.9543 18.6364 74.3238 19.5479 74.8165 20.3116C75.3092 21.0753 75.9374 21.6665 76.7011 22.0853C77.4894 22.5041 78.4132 22.7135 79.4725 22.7135C81.4187 22.7135 82.9337 22.0483 84.0176 20.7181C85.1016 19.3878 85.6436 17.1706 85.6436 14.0666C85.6436 12.8349 85.5327 11.6894 85.311 10.6301C85.0893 9.57076 84.7197 8.65927 84.2024 7.89559C83.7097 7.10727 83.0692 6.50371 82.2809 6.08492C81.5172 5.64149 80.5811 5.41978 79.4725 5.41978C77.551 5.41978 76.0482 6.10955 74.9643 7.48911C73.8804 8.86867 73.3384 11.0612 73.3384 14.0666Z" />
			</symbol>

			<symbol id="gps" viewBox="0 0 14 20">
				<path
					d="M6.8304 0.615234C3.23672 0.615234 0.312988 3.53897 0.312988 7.13264C0.312988 11.6495 6.83681 19.3652 6.83681 19.3652C6.83681 19.3652 13.3478 11.4274 13.3478 7.13264C13.3478 3.53897 10.4242 0.615234 6.8304 0.615234ZM8.79684 9.04095C8.25461 9.58305 7.54256 9.85416 6.8304 9.85416C6.11835 9.85416 5.40607 9.58305 4.86407 9.04095C3.77975 7.95673 3.77975 6.19251 4.86407 5.10818C5.38913 4.5829 6.08756 4.29359 6.8304 4.29359C7.57323 4.29359 8.27155 4.58301 8.79684 5.10818C9.88116 6.19251 9.88116 7.95673 8.79684 9.04095Z" />
			</symbol>

			<symbol id="whatsapp" viewBox="0 0 28 28">
				<path
					d="M23.94 4.02383C21.28 1.4525 17.78 0 14.0525 0C3.35417 0 -3.3635 11.5908 1.97867 20.811L0 28L7.39083 26.0727C10.6108 27.8122 13.2487 27.6582 14.0595 27.7608C26.4647 27.7608 32.6398 12.7528 23.9225 4.06933L23.94 4.02383Z"
					fill="#ECEFF1" />
				<path
					d="M14.0782 25.3762L14.0712 25.375H14.0525C10.3402 25.375 7.96832 23.6168 7.73499 23.5153L3.35999 24.6528L4.53249 20.4003L4.25365 19.9628C3.09865 18.1242 2.48499 16.0067 2.48499 13.8262C2.48499 3.56767 15.0208 -1.56216 22.2752 5.68867C29.512 12.8637 24.4312 25.3762 14.0782 25.3762Z"
					/>
				<path
					d="M20.4248 16.6915L20.4143 16.779C20.0632 16.604 18.3528 15.7675 18.0343 15.652C17.3192 15.3872 17.521 15.61 16.1478 17.1827C15.9437 17.4102 15.7407 17.4277 15.3942 17.2702C15.0442 17.0952 13.9207 16.7277 12.5907 15.5377C11.5547 14.6102 10.8593 13.4727 10.654 13.1227C10.3122 12.5324 11.0273 12.4484 11.6783 11.2164C11.795 10.9714 11.7355 10.7789 11.6492 10.605C11.5617 10.43 10.8652 8.71503 10.5735 8.03137C10.2935 7.35003 10.0053 7.43637 9.78949 7.43637C9.11749 7.37803 8.62633 7.38737 8.19349 7.8377C6.31049 9.90737 6.78533 12.0424 8.39649 14.3127C11.5628 18.4567 13.2498 19.2197 16.3345 20.279C17.1675 20.5439 17.927 20.5065 18.5278 20.4202C19.1975 20.314 20.5893 19.579 20.8798 18.7565C21.1773 17.934 21.1773 17.2515 21.0898 17.094C21.0035 16.9365 20.7748 16.849 20.4248 16.6915Z"
					fill="#FAFAFA" />
			</symbol>

			<symbol id="instagram" viewBox="0 0 35 35">
				<path d="M2.18757 2.38176C-0.562849 5.23864 6.74352e-05 8.27343 6.74352e-05 17.493C6.74352e-05 25.1493 -1.33577 32.8245 5.65548 34.6313C7.83861 35.1928 27.1819 35.1928 29.3622 34.6284C32.273 33.8774 34.6413 31.5163 34.9651 27.3995C35.0103 26.8249 35.0103 8.17134 34.9636 7.58509C34.6194 3.19989 31.9201 0.672593 28.3632 0.160718C27.548 0.0425933 27.3847 0.00759335 23.2022 0.000301678C8.36652 0.00759335 5.11444 -0.653032 2.18757 2.38176Z"/>
				<path d="M17.497 4.5779C12.2018 4.5779 7.17343 4.10686 5.25281 9.03603C4.45948 11.0719 4.57468 13.7158 4.57468 17.5017C4.57468 20.8237 4.46823 23.946 5.25281 25.9658C7.16906 30.8979 12.2382 30.4254 17.4941 30.4254C22.5647 30.4254 27.7928 30.9533 29.7368 25.9658C30.5316 23.9096 30.4149 21.305 30.4149 17.5017C30.4149 12.4529 30.6934 9.19353 28.2449 6.74644C25.7657 4.26728 22.413 4.5779 17.4911 4.5779H17.497ZM16.3391 6.90686C27.3845 6.88936 28.7903 5.66145 28.0145 22.7196C27.7389 28.7527 23.1451 28.0906 17.4984 28.0906C7.2026 28.0906 6.90656 27.796 6.90656 17.4958C6.90656 7.07603 7.72323 6.91269 16.3391 6.90394V6.90686ZM24.3949 9.05207C23.5389 9.05207 22.8447 9.74624 22.8447 10.6023C22.8447 11.4583 23.5389 12.1525 24.3949 12.1525C25.2509 12.1525 25.9451 11.4583 25.9451 10.6023C25.9451 9.74624 25.2509 9.05207 24.3949 9.05207ZM17.497 10.8648C13.8322 10.8648 10.8616 13.8369 10.8616 17.5017C10.8616 21.1664 13.8322 24.1371 17.497 24.1371C21.1618 24.1371 24.1309 21.1664 24.1309 17.5017C24.1309 13.8369 21.1618 10.8648 17.497 10.8648ZM17.497 13.1937C23.1918 13.1937 23.1991 21.8096 17.497 21.8096C11.8036 21.8096 11.7949 13.1937 17.497 13.1937Z" fill="white"/>
			</symbol>

			<symbol id="telegram" viewBox="0 0 512 512">
				<path d="M256,0C114.615,0,0,114.615,0,256S114.615,512,256,512,512,397.385,512,256,397.385,0,256,0ZM389.059,161.936,343.591,379a16.007,16.007,0,0,1-25.177,9.593l-66.136-48.861-40.068,37.8a5.429,5.429,0,0,1-7.74-.294l-.861-.946,6.962-67.375L336.055,194.266a3.358,3.358,0,0,0-4.061-5.317L171.515,290.519,102.4,267.307a9.393,9.393,0,0,1-.32-17.694L372.5,147.744A12.441,12.441,0,0,1,389.059,161.936Z"/>
			</symbol>

			<symbol id="arrow" viewBox="0 0 34 18">
				<path d="M1.32817 7.67186H29.4551L24.7957 3.03512C24.2758 2.51768 24.2739 1.67678 24.7913 1.15689C25.3087 0.636925 26.1497 0.635 26.6696 1.15237L33.6093 8.05861C33.6098 8.05901 33.6101 8.05947 33.6105 8.05987C34.1291 8.57731 34.1307 9.42093 33.6106 9.94009C33.6102 9.94049 33.6098 9.94095 33.6094 9.94135L26.6697 16.8476C26.1499 17.3649 25.3089 17.3631 24.7914 16.8431C24.274 16.3232 24.276 15.4823 24.7959 14.9648L29.4551 10.3281H1.32817C0.594646 10.3281 4.57764e-05 9.7335 4.57764e-05 8.99998C4.57764e-05 8.26646 0.594646 7.67186 1.32817 7.67186Z"/>
			</symbol>

			<symbol id="close" viewBox="0 0 42 42">
				<path d="M21.002,26.588l10.357,10.604c1.039,1.072,1.715,1.083,2.773,0l2.078-2.128
				c1.018-1.042,1.087-1.726,0-2.839L25.245,21L36.211,9.775c1.027-1.055,1.047-1.767,0-2.84l-2.078-2.127
				c-1.078-1.104-1.744-1.053-2.773,0L21.002,15.412L10.645,4.809c-1.029-1.053-1.695-1.104-2.773,0L5.794,6.936
				c-1.048,1.073-1.029,1.785,0,2.84L16.759,21L5.794,32.225c-1.087,1.113-1.029,1.797,0,2.839l2.077,2.128
				c1.049,1.083,1.725,1.072,2.773,0L21.002,26.588z"/>
			</symbol>
		</svg>

		<header class="header">
			<div class="container">
				<div class="header__inner">

					<div class="header__item">
						<div class="header__burger">
							<span></span>
						</div>
						<a href="#" class="logo">
							<svg class="logo__icon logo__icon--green">
								<use xlink:href="#logo"></use>
							</svg>
						</a>
						<a href="#" target="_blank" class="map">
							<svg class="map__icon">
								<use xlink:href="#gps"></use>
							</svg>
							<div class="map__address">
								<div class="map__title">Ростов-на-Дону</div>
								<div class="map__subtitle">ул. Ленина, 2Б</div>
							</div>
						</a>
					</div>

					<div class="header__item">
						<a href="#" class="whatsapp">
							<svg class="whatsapp__icon whatsapp__icon--top">
								<use xlink:href="#whatsapp"></use>
							</svg>
						</a>
						<div class="phone">
							<a href="tel:+78630000000">+7 (863) 000 00 00</a>
							<div class="map__address">
								<a href="#" class="map">
									<div class="map__title">Ростов-на-Дону</div>
								</a>
							</div>
						</div>
						<button class="btn btn--green popup-link">Записаться на прием</button>
					</div>

				</div>
			</div>
			<nav class="nav">
				<div class="container">
						<a href="#" class="nav__link">О клинике</a>
						<a href="#" class="nav__link">Услуги</a>
						<a href="#" class="nav__link">Специалисты</a>
						<a href="#" class="nav__link">Цены</a>
						<a href="#" class="nav__link">Контакты</a>
						<button class="btn popup-link">Записаться на прием</button>
				</div>
			</nav>
	
		</header>

	<div class="main">
		<div class="intro">
			<div class="container">
				<div class="intro__inner">

					<div class="intro__item">
						<div class="intro__content">
							<h1 class="intro__title">Многопрофильная клиника для детей
								и взрослых</h1>
							<div class="intro__text">Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua</div>
						</div>
					</div>
					
					<div class="intro__item">
						<img src="img/intro.jpg" alt="" class="intro__img">
					</div>
				</div>
			</div>
		</div>

		<div class="slider">
			<div class="container">
				<div class="slider__inner swiper">
					<div class="swiper-wrapper">


					<?php
						foreach ($checkup as $value) {
							echo "<div class='slider__item swiper-slide'>
							<div class='checkup'>
								<div class='checkup__title'>Check-UP</div>
								<div class='checkup__subtitle'>для ".$value['gender']."</div>
								<ul class='checkup__ul'>
									<li class='checkup__li'>".$value['check1']."</li>
									<li class='checkup__li'>".$value['check2']."</li>
									<li class='checkup__li'>".$value['check3']."</li>
									<li class='checkup__li'>".$value['check4']."</li>
								</ul>
								<div class='checkup__price'>Всего ".$value['new_price']."₽ <span>".$value['old_price']."₽</span></div>
								<div class='checkup__btn'>
									<button class='btn btn--green popup-link'>Записаться</button>
									<button class='btn'>Подробнее</button>
								</div>
								<div class='checkup__trapezoid'></div>
							</div>

							<div class='slider__photo'>
								<img src='img/check-up.jpg' alt='' class='slider__img'>
							</div>
					</div>";
						}
					?>

					</div><!-- /swiper-wrapper -->

					<div class="slider__panel">
						<div class="slider__btn slider__btn-prev">
							<svg class="slider__arrow">
								<use xlink:href="#arrow"></use>
							</svg>
						</div>
						<div class="slider__pagination"></div>
						<div class="slider__btn slider__btn-next">
							<svg class="slider__arrow">
								<use xlink:href="#arrow"></use>
							</svg>
						</div>
					</div>

				</div><!-- /slider__inner -->
			</div><!-- /container -->
		</div><!-- /slider -->
	</div><!-- /main -->


		<footer class="footer">
			<div class="container">
				<div class="footer__inner">

					<div class="footer__item">
						<a href="#" class="logo">
							<svg class="logo__icon">
								<use xlink:href="#logo"></use>
							</svg>
						</a>
					</div>

					<div class="footer__item">
						<nav class="footer__nav">
							<div class="container">
								<a href="#" class="nav__link">О клинике</a>
								<a href="#" class="nav__link">Услуги</a>
								<a href="#" class="nav__link">Специалисты</a>
								<a href="#" class="nav__link">Цены</a>
								<a href="#" class="nav__link">Контакты</a>
							</div>
						</nav>
					</div>

					<div class="footer__item">
						<div class="social">
							<a href="#" class="social__links">
								<svg class="instagram__icon social__icon">
									<use xlink:href="#instagram"></use>
								</svg>
							</a>
							<a href="#" class="social__links">
								<svg class="whatsapp__icon social__icon">
									<use xlink:href="#whatsapp"></use>
								</svg>
							</a>
							<a href="#" class="social__links">
								<svg class="telegram__icon social__icon">
									<use xlink:href="#telegram"></use>
								</svg>
							</a>
						</div>
					</div>

				</div>
			</div>
		</footer>

		<div id="popup" class="popup">
			<div class="popup__body">
				<div class="popup__content">
					<a href="#" class="popup__close">
						<svg class="close">
							<use xlink:href="#close"></use>
						</svg>
					</a>
					<div class="form">
						<form action="mail.php" id="form" class="form__body">
							<h2 class="form__title">
								Сообщите нам ваши данные, и мы обязательно перезвоним.
							</h2>
							<div class="form__item">
								<label for="formName">Ваше имя:</label>
								<input id="formName" type="text" name="name" class="form__input _req">
							</div>
							<div class="form__item">
								<label for="formTel">Ваше телефон:</label>
							<input id="formTel" type="tel" name="tel" placeholder="+7 (999) 999-99-99" class="form__input _req">
						</div>
						<div class="form__item">
						<button type="submit" class="btn btn--green" >Отправить</button>
						</div>
						</form>
					</div>
				</div>
			</div>
		</div>

		<div class="feedback">
			<div class="feedback__body">
				<div class="feedback__content">
					<a href="#" class="feedback__close">
						<svg class="close">
							<use xlink:href="#close"></use>
						</svg>
					</a>
					<h2 class="feedback__title">Данные успешно отправлены</h2>
					<div class="feedback__text">Специалист позвонит вам в ближайшее время</div>
				</div>
			</div>
		</div>
	
	</div><!-- /wrapper -->

	<script src="https://unpkg.com/swiper@7/swiper-bundle.min.js"></script>
	<script src="js/app.js"></script>
</body>

</html>